RakshithaKukkePrakash/ReactionGame/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "ErikaOS_1_ee.h"
#include "ErikaOS_1_ee_tracing.h"
#include "SEVEN_A_aliases.h"
#include "SEVEN_A.h"
#include "SEVEN_B_aliases.h"
#include "SEVEN_B.h"
#include "SEVEN_C_aliases.h"
#include "SEVEN_C.h"
#include "SEVEN_D_aliases.h"
#include "SEVEN_D.h"
#include "SEVEN_E_aliases.h"
#include "SEVEN_E.h"
#include "SEVEN_F_aliases.h"
#include "SEVEN_F.h"
#include "SEVEN_G_aliases.h"
#include "SEVEN_G.h"
#include "SEVEN_DP_aliases.h"
#include "SEVEN_DP.h"
#include "SEVEN_SELECT_aliases.h"
#include "SEVEN_SELECT.h"
#include "SEVEN_reg.h"
#include "BUTTON_1_aliases.h"
#include "BUTTON_1.h"
#include "isr_Button.h"
#include "BUTTON_2_aliases.h"
#include "BUTTON_2.h"
#include "BUTTON_3_aliases.h"
#include "BUTTON_3.h"
#include "BUTTON_4_aliases.h"
#include "BUTTON_4.h"
#include "RGB_B_aliases.h"
#include "RGB_B.h"
#include "RGB_G_aliases.h"
#include "RGB_G.h"
#include "RGB_R_aliases.h"
#include "RGB_R.h"
#include "UART_LOG.h"
#include "RGB_PWM_blue.h"
#include "RGB_PWM_green.h"
#include "RGB_PWM_red.h"
#include "USBUART.h"
#include "USBUART_audio.h"
#include "USBUART_cdc.h"
#include "USBUART_hid.h"
#include "USBUART_midi.h"
#include "USBUART_pvt.h"
#include "USBUART_cydmac.h"
#include "USBUART_msc.h"
#include "BUTTON_JOYSTICK_aliases.h"
#include "BUTTON_JOYSTICK.h"
#include "isr_Button_Joystick.h"
#include "JOYSTICK_X_aliases.h"
#include "JOYSTICK_X.h"
#include "JOYSTICK_Y_aliases.h"
#include "JOYSTICK_Y.h"
#include "JOYSTICK_ADC_XY.h"
#include "TFT_SPI.h"
#include "TFT_SPI_PVT.h"
#include "TFT_SCL_aliases.h"
#include "TFT_SCL.h"
#include "TFT_DC_aliases.h"
#include "TFT_DC.h"
#include "TFT_RES_aliases.h"
#include "TFT_RES.h"
#include "TFT_CS_aliases.h"
#include "TFT_CS.h"
#include "TFT_LED_aliases.h"
#include "TFT_LED.h"
#include "TFT_SDA_aliases.h"
#include "TFT_SDA.h"
#include "TFT_BackLight.h"
#include "CLK_LED.h"
#include "isr_Reset.h"
#include "PWM_Red.h"
#include "PWM_Yellow.h"
#include "LED_green_aliases.h"
#include "LED_green.h"
#include "LED_yellow_aliases.h"
#include "LED_yellow.h"
#include "LED_red_aliases.h"
#include "LED_red.h"
#include "PWM_Clock2.h"
#include "PWM_Green.h"
#include "UART_LOG_IntClock.h"
#include "USBUART_Dm_aliases.h"
#include "USBUART_Dm.h"
#include "USBUART_Dp_aliases.h"
#include "USBUART_Dp.h"
#include "JOYSTICK_ADC_XY_SAR.h"
#include "JOYSTICK_ADC_XY_IntClock.h"
#include "JOYSTICK_ADC_XY_TempBuf_dma.h"
#include "JOYSTICK_ADC_XY_FinalBuf_dma.h"
#include "JOYSTICK_ADC_XY_IRQ.h"
#include "TFT_SPI_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

